; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-88)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 - object)
 (:init 
    (arm-empty)
    (clear b25)
    (on b25 b8)
    (on b8 b20)
    (on b20 b2)
    (on b2 b13)
    (on b13 b6)
    (on-table b6)
    (clear b22)
    (on b22 b17)
    (on b17 b5)
    (on b5 b15)
    (on b15 b12)
    (on b12 b3)
    (on b3 b14)
    (on b14 b9)
    (on b9 b1)
    (on b1 b16)
    (on b16 b21)
    (on b21 b19)
    (on b19 b26)
    (on b26 b23)
    (on b23 b11)
    (on b11 b24)
    (on b24 b18)
    (on b18 b4)
    (on b4 b7)
    (on b7 b10)
    (on-table b10))
 (:goal (and 
(on-table b20)
))
)

; plan
1. (unstack b25 b8)
   deleted: (on b25 b8) (clear b25) (arm-empty)
   added: (holding b25) (clear b8)
   goals met: 0 of 1
2. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 1
3. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 0 of 1
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
5. (unstack b20 b2)
   deleted: (on b20 b2) (clear b20) (arm-empty)
   added: (holding b20) (clear b2)
   goals met: 0 of 1
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 1
